/**
 * TargetTypes.js
 * 対象種別
 */

const TargetTypes = Object.freeze({

    //--------------------------------------
    // 対象なし
    //--------------------------------------

    NONE: "NONE",

    //--------------------------------------
    // 自分
    //--------------------------------------

    SELF: "SELF",

    //--------------------------------------
    // プレイヤー
    //--------------------------------------

    PLAYER: "PLAYER",

    OPPONENT: "OPPONENT",

    ALL_PLAYERS: "ALL_PLAYERS",

    //--------------------------------------
    // カード
    //--------------------------------------

    SELF_CARD: "SELF_CARD",

    TARGET_CARD: "TARGET_CARD",

    ALL_CARDS: "ALL_CARDS",

    //--------------------------------------
    // ゾーン
    //--------------------------------------

    HAND: "HAND",

    DECK: "DECK",

    DISCARD: "DISCARD"

});

export default TargetTypes;